In [5]:
import pandas as pd
import seaborn as sns

In [7]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [10]:
mpg = sns.load_dataset('mpg')
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [12]:
type(titanic)

pandas.core.frame.DataFrame

In [14]:
df = titanic.loc[:,['age','sex','survived','fare']]
df

      age     sex  survived     fare
0    22.0    male         0   7.2500
1    38.0  female         1  71.2833
2    26.0  female         1   7.9250
3    35.0  female         1  53.1000
4    35.0    male         0   8.0500
..    ...     ...       ...      ...
886  27.0    male         0  13.0000
887  19.0  female         1  30.0000
888   NaN  female         0  23.4500
889  26.0    male         1  30.0000
890  32.0    male         0   7.7500

[891 rows x 4 columns]